src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <attributes>
    <name>ДатаВремяСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ОписанияПоОбъектам/ОписанияПоОбъектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписанияПоОбъектам</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Описание</name>
    <type>
      <types>CatalogRef.Описания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОписанияВХранилищах/ОписанияВХранилищах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписанияВХранилищах</name>
  <resources>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Описание</name>
    <type>
      <types>CatalogRef.Описания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВариантыХраненияОписания/ВариантыХраненияОписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыХраненияОписания</name>
  <enumValues>
    <name>ВХранилище</name>
  </enumValues>
  <enumValues>
    <name>ВФайле</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Задачи/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ДополнительныеСвойства.Описание) Тогда
		Описание = ДополнительныеСвойства.Описание;
	Иначе
		НовоеОписание = Справочники.Описания.СоздатьЭлемент();
		НовоеОписание.ВариантХраненияОписания = Перечисления.ВариантыХраненияОписания.ВХранилище; // TODO: получать из настроек
		НовоеОписание.Записать();
		
		Описание = НовоеОписание.Ссылка;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ОписанияПоОбъектам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Ссылка;
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.Записать();
	
	Если Описание.ВариантХраненияОписания = Перечисления.ВариантыХраненияОписания.ВХранилище Тогда
		МенеджерЗаписи = РегистрыСведений.ОписанияВХранилищах.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Описание = Описание;
		МенеджерЗаписи.Хранилище = Новый ХранилищеЗначения(ДополнительныеСвойства.РедакторОписания);
		МенеджерЗаписи.Записать();		
	КонецЕсли;
		
КонецПроцедуры
